OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/incompressible/pimpleFoam/RAS/TJunctionFan/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [m^2 s^-2];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            uniformTotalPressure;
        p0              table
        (
            (0 10)
            (1 40)
        );
    }
    outlet1
    {
        type            fixedValue;
        value           uniform 10;
    }
    outlet2
    {
        type            fixedValue;
        value           uniform 0;
    }
    defaultFaces
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
